proc cpt_bin.v {} {
    set NAME "cpt_bin"

    read_verilog src/$PATH/$NAME.v
    chparam -set "SIZE" $WIRE $NAME

    general $PATH $NAME
    
}

proc synth_compteur {WAY WIRE} {
    set PATH "compteur"

    make_dir $PATH

    synth_add $PATH
    synth_addX $PATH $WIRE
    synth_add_sub $PATH $WIRE
    synth_cmp $PATH $WIRE
    synth_divmod2 $PATH $WIRE
    synth_multX $PATH $WIRE

    cpt_bin $WIRE
}
